<p style="font-size:30px; text-align:center; line-height:120%">
<br>
COMS W 4111-03, H03, V03<br>
Introduction to Databases<br>
Spring 2019 Take Home Midterm
</p>

# Exam Overview and Instructions

- Homework assignments and exams have point values that contribute to the final grade. Final grade depends on total point value. The range of total possible points for a semester is 0 to 100 points.
    - The grade for this midterm is in the range 0 to 100. The sum of the point values of the questions is 110 points. You can answer all questions and your grade will be the sum of the points up to a maximum of 100. Answering all questions cannot decrease your grade. The point values of the questions is:
        - Section 3 has 5 questions that require writing SQL queries. Each questions is work 10 points.
        - Sections 4, 5, 6 and 7 each have one question woth 15 points.
    - __This midterm exam is contributes 20 points__ for your final semester point total. So, divide your score on this exam by 5 to determine point contribution.


- Submission:
    - The exam is due on Sunday, 17-Mar-2018 at 11:59PM. __You may not use grace days.__
    - Submission:
        - Submission format is a zip file containing this Jupyter Notebook with your solutions entered into the code cells or Markdown cells for each question. If you embed images or diagrams, you need to include the images in the zip file.
        - The file name must be of the form "uni_midterm_s_2019.zip" Replace the string "uni" with your uni. Please do not submit a file without performing the replacement.
        - You submit your homework on CourseWorks under [Midterm Examination](https://courseworks2.columbia.edu/courses/79571/assignments/274101) assignment.
        - No other formats are allowed.
        - If the notebook format is incorrect or the notebook is corrupted, the grade is 0.
        - Submissions after the due date and time are not allowed. Submissions not received on time receive a grade of 0.
    - Respect for the individual is paramount. We will accommodate special circumstances, but we must be notified and discuss __in advance.__
    

- Exam Rules:
    - Please read and review the [Academic Integrity policy and guidelines](https://www.college.columbia.edu/academics/academicintegrity), including subsections and details. This material defines the base rules for this exam regardless of your school.
    - No student collaboration of any form is permitted. You may not share material of any form, including links to on-line information, __information from the preparatory recitation section,__ suggestions or ideas, etc.
    - You __MAY__ use material from office hours or recitations.
    - You __MAY__ use any on-line information you find, but may not directly use code you find. You must cite any on-line sources in the comments Markdown cell for each questions.
    - You must privately send comments or questions to Professor Ferguson __via email.__ If questions or comments demonstrate a need for clarification or correction, Prof. Ferguson will update this document and post the correction information on this and only this [Piazza topic.](https://piazza.com/class/jpltphl4wz76cm?cid=595)
    - You may not discuss the exam on Piazza. Private posting and anonymous post is disabled during the midterm examination period, and will be re-enabled after the midterm.

- Completing the exam:
    - Environment:
        - You must use an unmodified, original lahman 2017 database for many of the questions.
        - Other questions ask you to create a database/schema. The questions provide instructions.
        - You can load the original Lahman 2017 database by downloading and unzipping this file: [lahman2017raw.sql](https://courseworks2.columbia.edu/files/4377424/download?download_frd=1)
            - You can import the data and create the database in MySQL Workbech.
            - Use the menu function "Server->Data Import." 
            - Check the option "Import from Self-Contained File."
            - Make sure that "Dump Structure and Data" is chosen in the selection in the last row of the import wizard.
        - You must install and use [%%SQL Magic for iPtython](https://github.com/catherinedevlin/ipython-sql) for executing any SQL statements in code cells.
        - Section 2 tests the setup of your environment. You __MUST USE__  dbuser:dbuserdbuser@localhost/lahman2017raw. 
        - Your database __MUST HAVE__ a user ```dbuser``` with pasword ```dbuserdbuser```
    - Each question starts with an explanation of the structure of the answer, e.g. prose, diagram, SQL, etc.
    - Questions requiring SQL or code have empty code cells where you enter your statements. Some also contain sample answers to help you determine if your answer is correct. You must show the execution of your SQL in your submission. You may use LIMIT 10 to reduce the size of results.
    - Some of the queries may take several minutes to complete. In module II, we will demonstrate how to improve query performance using indexes.

# Environment Test

This section tests the environment. You must change the "userid:pw" to "dbuser:dbuserdbuser" for your MySQL instance. Unless you have received an exception, you __MUST USE dbuser:dbuserdbuser.__

## SQL Magic Plugin

In [614]:
%reload_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/lahman2017raw
%sql select * from people where playerid='willite01'

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('willite01', '1918', '8', '30', 'USA', 'CA', 'San Diego', '2002', '7', '5', 'USA', 'FL', 'Inverness', 'Ted', 'Williams', 'Theodore Samuel', '205', '75', 'L', 'R', '1939-04-20', '1960-09-28', 'willt103', 'willite01')]

## Helper Python Libraries

### Imports

In [2]:
import pymysql
import json
import copy
import pymysql.cursors

"""
The core exceptions that PyMySQL throws. A data access abstraction layer like XXXDataTable
would convert to a common set of data technology independent exceptions. This enables a single
application code base for accessing data.

Just FYI. I do not use in this code.
"""
pymysql_exceptions = (
    pymysql.err.IntegrityError,
    pymysql.err.MySQLError,
    pymysql.err.ProgrammingError,
    pymysql.err.InternalError,
    pymysql.err.DatabaseError,
    pymysql.err.DataError,
    pymysql.err.InterfaceError,
    pymysql.err.NotSupportedError,
    pymysql.err.OperationalError)

### Connection Management and JSON Helpers

In [611]:
# Default connection info to use if caller does not specify one.
_default_connect_info = {
        'host': 'localhost',
        'user': 'dbuser',
        'password': 'dbuserdbuser',
        'db': 'lahman2017raw',
        'port': 3306
    }

# Shared, default connection to use if the caller does not provide a specific
# connection.
_default_cnx = pymysql.connect(
               _default_connect_info['host'],
                _default_connect_info['user'],
                _default_connect_info['password'],
                _default_connect_info['db'],
            charset='utf8mb4',
            cursorclass=pymysql.cursors.DictCursor)

# A pool of names connections.
_connections = {}


def safe_json_dump(o):
    """

    :param o: Object to dump to a string.
    :return: json.dumps() with default=str or text if cannot convert to JSON.
    """

    try:
        result = json.dumps(o, indent=2, default=str)
    except Exception as e:
        result = "Not JSON - " + print(o)

    return result


def get_connection(c_name, host=None, port=None, user=None, password=None, db=None):
    """

    :param c_name: Name of a possibly pre-created connection.
    :param host: Host for a new connection
    :param port: Port for a new connection
    :param user: User for a new connection.
    :param password: Password for new connection.
    :param db: DB/schema to connect to.
    :return: The pre-created connection if it exists, or a connection created with the
    passed parameters.
    """

    try:
        cnx = _connections.get(c_name, None)
    
        if cnx is None:
            c_info = copy.copy(_default_connect_info)
            if host is not None:
                c_info['host'] = host
            if port is not None:
                c_info['port'] = port
            if user is not None:
                c_info['user'] = user
            if password is not None:
                c_info['password'] = password
            if db is not None:
                c_info['db'] = db
            c_info['charset']= 'utf8mb4'
            c_info['cursorclass'] = pymysql.cursors.DictCursor
                
            cnx = pymysql.connect(**c_info)


    except Exception as e:
        print("Connect failure, e = ", e)
        raise e

    return cnx

### Helper Method for Running Query

__NOTE:__ Do not worry about the commit, cursor, etc. parameters. This is set up for module II topics.

In [4]:
def run_q(cnx=None, q=None, args=None, fetch=False, commit=True, cursor=None, rowid=None):
    """

    :param cnx: Caller supplied connection to use. One is created, if none.
    :param q: Query string
    :param args: Args for insertion to replace %s parameters
    :param fetch: Return the resulting rowset. If False/None, return the response code from
    the cursor operation.
    :param commit: Commit the transaction if true.
    :param cursor: Cursor to use for operation. One is created if None.
    :param rowid: Get and return auto-increment rowid if true.

    :return: Rowset from fetchall, cursor RC or rowid depending of parameters.
    """

    result = None

    try:
        connection_created = False

        if cursor is None:
            if cnx is None:
                cnx = get_connection(c_name=None)
                connection_created = True

            cursor = cnx.cursor()

        qs = cursor.mogrify(q, args)
        #print("Mogrified cursor = ", qs)

        result = cursor.execute(q, args)


        if fetch:
            result = cursor.fetchall()
        else:
            if rowid:
                result = cursor.lastrowid

        if commit:
            cnx.commit()
        if connection_created:
            cnx.close()

    except pymysql_exceptions as original_e:
        print("Original exception = ", original_e)

        if commit:
            cnx.rollback()

        if connection_created:
            cnx.close()

        raise (original_e)

    return result

In [5]:
run_q(cnx=None, q="select playerID, nameLast, nameFirst from people where playerid = %s", 
      args=('willite01'), fetch=True)

[{'playerID': 'willite01', 'nameLast': 'Williams', 'nameFirst': 'Ted'}]

# SQL Data Manipulation Language Questions

## Complex Query $-$ Performance Statistics by Year (10 points)

### Question

- Use the ```lahman2017raw``` database/schema.


- Create an annual performance summary table using a single query statement. 


- The columns are:
    - From ```people:``` ``` playerID, nameLast, nameFirst, birthYear, deathYear, bats, throws```
    - From ```appeareances:``` ```teamid, yearid, g_all```
    - From ```batting:``` 
        - The underlying columns are ```ab, h, hr, rbi```
        - The row for a ```teamID, yearID``` is the sum for the year.
    - From ```fielding:``` 
        - The underlying columns are ```a, e, po```
        - The row for a ```teamID, yearID``` is the sum for the year.
    - From ```pitching:``` 
        - The underlying columns are ```g, w, l```
        - The row for a ```teamID, yearID``` is the sum for the year.


- Test your result for playerID 'martipe02'


- __Note:__
- Your query must produce the correct results for any ```playerID.``` We will text using other ```playerIDs.```
- Your column names and values __MUST__ match the same answer.

### Answer

In [623]:
%%sql
use lahman2017raw;
SELECT
    people.playerid, people.nameLast, people.nameFirst, people.birthYear,
    if(length(deathYear) > 0, deathYear, "--") as deathYear, people.bats, people.throws,
    appearances.teamid, appearances.yearid, appearances.g_all,
    ifnull(batting_year.ab,0) as ab, ifnull(batting_year.h,0) as h, ifnull(batting_year.hr,0) as hr,
    ifnull(batting_year.rbi,0) as rbi, ifnull(fielding_year.a,0) as a, ifnull(fielding_year.e,0) as e, 
    ifnull(fielding_year.po,0) as po, ifnull(pitching_year.p_g,0) as g, ifnull(pitching_year.w,0) as w, 
    ifnull(pitching_year.l,0) as l
FROM
    people LEFT JOIN appearances USING(playerID)
    LEFT JOIN (SELECT playerID, teamID, yearID, sum(ab) as ab, sum(h) as h, sum(hr) as hr, sum(rbi) as rbi
            from batting GROUP BY playerID, teamID, yearID) as batting_year
            ON appearances.playerID = batting_year.playerID AND appearances.teamID = batting_year.teamID  AND
                appearances.yearID = batting_year.yearID
    LEFT JOIN (SELECT playerID, teamID, yearID, sum(a) as a, sum(e) as e, sum(po) as po
            from fielding GROUP BY playerID, teamID, yearID) as fielding_year
            ON appearances.playerID = fielding_year.playerID AND appearances.teamID = fielding_year.teamID  AND
                appearances.yearID = fielding_year.yearID
    LEFT JOIN (SELECT playerID, teamID, yearID, sum(g) as p_g, sum(w) as w, sum(l) as l
            from pitching GROUP BY playerID, teamID, yearID) as pitching_year
            ON appearances.playerID = pitching_year.playerID AND appearances.teamID = pitching_year.teamID  AND
                appearances.yearID = pitching_year.yearID
WHERE
    people.playerID = 'martipe02';

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.
18 rows affected.

[('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '1998', '33', 7.0, 0.0, 0.0, 0.0, 18.0, 4.0, 11.0, 33.0, 19.0, 7.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '1999', '31', 2.0, 0.0, 0.0, 0.0, 15.0, 1.0, 13.0, 31.0, 23.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2000', '29', 0.0, 0.0, 0.0, 0.0, 28.0, 0.0, 14.0, 29.0, 18.0, 6.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2001', '18', 0.0, 0.0, 0.0, 0.0, 5.0, 0.0, 5.0, 18.0, 7.0, 3.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2002', '30', 5.0, 0.0, 0.0, 0.0, 16.0, 2.0, 16.0, 30.0, 20.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2003', '29', 3.0, 0.0, 0.0, 0.0, 20.0, 0.0, 14.0, 29.0, 14.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2004', '33', 2.0, 0.0, 0.0, 0.0, 16.0, 1.0, 16.0, 33.0, 16.0, 9.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'LAN', '1992', '2', 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 2.0, 0.0, 1.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'LAN', '1993', '66', 4.0, 0.0, 0.0, 0.0, 4.0, 0.0, 4.0, 65.0, 10.0, 5.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1994', '24', 44.0, 4.0, 0.0, 5.0, 15.0, 4.0, 9.0, 24.0, 11.0, 5.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1995', '30', 63.0, 7.0, 0.0, 2.0, 23.0, 2.0, 14.0, 30.0, 14.0, 10.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1996', '33', 64.0, 6.0, 0.0, 4.0, 17.0, 3.0, 11.0, 33.0, 13.0, 10.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1997', '31', 69.0, 8.0, 0.0, 0.0, 31.0, 1.0, 7.0, 31.0, 17.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2005', '31', 69.0, 6.0, 0.0, 1.0, 19.0, 0.0, 6.0, 31.0, 15.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2006', '23', 38.0, 4.0, 0.0, 1.0, 13.0, 5.0, 7.0, 23.0, 9.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2007', '5', 9.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 5.0, 3.0, 1.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2008', '20', 39.0, 6.0, 0.0, 4.0, 17.0, 0.0, 6.0, 20.0, 5.0, 6.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'PHI', '2009', '9', 14.0, 1.0, 0.0, 1.0, 6.0, 0.0, 1.0, 9.0, 5.0, 1.0)]

In [11]:
%%sql

18 rows affected.

[('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '1998', '33', 7.0, 0.0, 0.0, 0.0, 18.0, 4.0, 11.0, 33.0, 19.0, 7.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '1999', '31', 2.0, 0.0, 0.0, 0.0, 15.0, 1.0, 13.0, 31.0, 23.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2000', '29', 0.0, 0.0, 0.0, 0.0, 28.0, 0.0, 14.0, 29.0, 18.0, 6.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2001', '18', 0.0, 0.0, 0.0, 0.0, 5.0, 0.0, 5.0, 18.0, 7.0, 3.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2002', '30', 5.0, 0.0, 0.0, 0.0, 16.0, 2.0, 16.0, 30.0, 20.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2003', '29', 3.0, 0.0, 0.0, 0.0, 20.0, 0.0, 14.0, 29.0, 14.0, 4.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'BOS', '2004', '33', 2.0, 0.0, 0.0, 0.0, 16.0, 1.0, 16.0, 33.0, 16.0, 9.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'LAN', '1992', '2', 2.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 2.0, 0.0, 1.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'LAN', '1993', '66', 4.0, 0.0, 0.0, 0.0, 4.0, 0.0, 4.0, 65.0, 10.0, 5.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1994', '24', 44.0, 4.0, 0.0, 5.0, 15.0, 4.0, 9.0, 24.0, 11.0, 5.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1995', '30', 63.0, 7.0, 0.0, 2.0, 23.0, 2.0, 14.0, 30.0, 14.0, 10.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1996', '33', 64.0, 6.0, 0.0, 4.0, 17.0, 3.0, 11.0, 33.0, 13.0, 10.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'MON', '1997', '31', 69.0, 8.0, 0.0, 0.0, 31.0, 1.0, 7.0, 31.0, 17.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2005', '31', 69.0, 6.0, 0.0, 1.0, 19.0, 0.0, 6.0, 31.0, 15.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2006', '23', 38.0, 4.0, 0.0, 1.0, 13.0, 5.0, 7.0, 23.0, 9.0, 8.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2007', '5', 9.0, 1.0, 0.0, 0.0, 0.0, 0.0, 1.0, 5.0, 3.0, 1.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'NYN', '2008', '20', 39.0, 6.0, 0.0, 4.0, 17.0, 0.0, 6.0, 20.0, 5.0, 6.0),
 ('martipe02', 'Martinez', 'Pedro', '1971', '--', 'R', 'R', 'PHI', '2009', '9', 14.0, 1.0, 0.0, 1.0, 6.0, 0.0, 1.0, 9.0, 5.0, 1.0)]

### Notes, Comments

__Note:__
- You may add any comments or clarifications here.
- This is optional.
- Double click on this cell/text to open the Markdown edit box.
- You do not need to use markdown and can just enter text.
- There are many Markdown tutorials on the web, e.g. [this tutorial](https://www.markdowntutorial.com/)

## Determine People who Played for and Managed the Same Team in their Career<br> (10 points)

### Question

- A person (```playerID```) played for a team (```teamID```) if there is an entry for the ```playerid, teamid``` combination in ```appearances.```


- A person (```playerID```) managed a team (```teamID```) if there is an entry for the ```playerid, teamid``` combination in ```managers.```


- Write a query that returns a table containing rows for people who played for and managed the same team, but not necessarily in the same year.


- The resulting table should have the following columns:
    - From ```people: playerID``` and first_name, last_name
    - From ```appearances: teamID``` and the total games played for the team
    - From ```Managers:``` the total number of games managed.
    - The result should also contain: ```first_year, last_year.``` first_year is the earliest of the first row in ```managers``` or ```players``` and last_year is the latest year the person played or managed for the team.
    

- The resulting table __MUST__
    - Be ordered by last_year, descending and use limit 10.
    - Match the column names, column values, etc. in the sample answer.


- Your query may use only one ```JOIN.```

### Answer

In [624]:
%%sql
use lahman2017raw;
SELECT 
p.playerID, p.nameLast, p.nameFirst,
a.teamID, a.total_play,
m.total_mg,

CASE WHEN a.min_ay < m.min_my THEN a.min_ay
    ELSE m.min_my
    END AS first_year,

CASE WHEN a.max_ay > m.max_my THEN a.max_ay
    ELSE m.max_my
    END AS last_year

FROM people as p,
(
    (SELECT playerID, teamID, cast(sum(G_all) as unsigned) AS total_play, min(yearid) AS min_ay, max(yearid) AS max_ay
    FROM appearances GROUP BY playerid, teamid)as a
    INNER JOIN
    (SELECT playerid, teamid, cast(sum(G) as unsigned) AS total_mg, min(yearid) AS min_my, max(yearid) AS max_my 
    FROM managers GROUP BY playerid, teamid) as m
    ON a.teamid = m.teamid
)
WHERE p.playerid = a.playerid
AND p.playerid = m.playerid

ORDER BY last_year DESC LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.
10 rows affected.

[('girarjo01', 'Girardi', 'Joe', 'NYA', 379, 1620, '1996', '2017'),
 ('mathemi01', 'Matheny', 'Mike', 'SLN', 622, 972, '2000', '2017'),
 ('roberda07', 'Roberts', 'Dave', 'LAN', 302, 324, '2002', '2017'),
 ('counscr01', 'Counsell', 'Craig', 'MIL', 711, 461, '2004', '2017'),
 ('mackape01', 'Mackanin', 'Pete', 'PHI', 18, 412, '1978', '2017'),
 ('ausmubr01', 'Ausmus', 'Brad', 'DET', 352, 646, '1996', '2017'),
 ('cashke01', 'Cash', 'Kevin', 'TBA', 13, 486, '2005', '2017'),
 ('molitpa01', 'Molitor', 'Paul', 'MIN', 422, 486, '1996', '2017'),
 ('francte01', 'Francona', 'Terry', 'CLE', 62, 808, '1988', '2017'),
 ('weisswa01', 'Weiss', 'Walt', 'COL', 523, 648, '1994', '2016')]

In [625]:
%%sql
use lahman2017raw;
SELECT a.playerID,
    (SELECT nameLast FROM people WHERE a.playerid = people.playerID) as last_name,
    (SELECT nameFirst FROM people WHERE a.playerid = people.playerID) as first_name,
    a.teamid, a.player_p AS g_played, b.player_m as g_managed,
        if (a.p_min_yearid < b.m_min_yearid, a.p_min_yearid, b.m_min_yearid) as first_year,
        if (a.p_max_yearid > b.m_max_yearid, a.p_max_yearid, b.m_max_yearid) as last_year,
        (a.player_p + b.player_m) as total_g
FROM (SELECT playerid, teamid, min(yearid) as p_min_yearid, max(yearid) as p_max_yearid,
        cast(sum(g_all) as unsigned) as player_p from appearances group by playerid, teamid) as a
JOIN
    (SELECT playerid, teamid, min(yearid) as m_min_yearid, max(yearid) as m_max_yearid,
        cast(sum(g) as unsigned) as player_m from managers group by playerid, teamid) as b
ON 
    a.playerid = b.playerid
AND 
    a.teamid = b.teamid
ORDER BY last_year DESC LIMIT 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.
10 rows affected.

[('counscr01', 'Counsell', 'Craig', 'MIL', 711, 461, '2004', '2017', 1172),
 ('francte01', 'Francona', 'Terry', 'CLE', 62, 808, '1988', '2017', 870),
 ('cashke01', 'Cash', 'Kevin', 'TBA', 13, 486, '2005', '2017', 499),
 ('ausmubr01', 'Ausmus', 'Brad', 'DET', 352, 646, '1996', '2017', 998),
 ('girarjo01', 'Girardi', 'Joe', 'NYA', 379, 1620, '1996', '2017', 1999),
 ('mackape01', 'Mackanin', 'Pete', 'PHI', 18, 412, '1978', '2017', 430),
 ('molitpa01', 'Molitor', 'Paul', 'MIN', 422, 486, '1996', '2017', 908),
 ('mathemi01', 'Matheny', 'Mike', 'SLN', 622, 972, '2000', '2017', 1594),
 ('roberda07', 'Roberts', 'Dave', 'LAN', 302, 324, '2002', '2017', 626),
 ('weisswa01', 'Weiss', 'Walt', 'COL', 523, 648, '1994', '2016', 1171)]

In [13]:
%%sql

10 rows affected.

[('ausmubr01', 'Ausmus', 'Brad', 'DET', 352.0, 646.0, '1996', '2017', 998.0),
 ('cashke01', 'Cash', 'Kevin', 'TBA', 13.0, 486.0, '2005', '2017', 499.0),
 ('counscr01', 'Counsell', 'Craig', 'MIL', 711.0, 461.0, '2004', '2017', 1172.0),
 ('francte01', 'Francona', 'Terry', 'CLE', 62.0, 808.0, '1988', '2017', 870.0),
 ('girarjo01', 'Girardi', 'Joe', 'NYA', 379.0, 1620.0, '1996', '2017', 1999.0),
 ('mackape01', 'Mackanin', 'Pete', 'PHI', 18.0, 412.0, '1978', '2017', 430.0),
 ('mathemi01', 'Matheny', 'Mike', 'SLN', 622.0, 972.0, '2000', '2017', 1594.0),
 ('molitpa01', 'Molitor', 'Paul', 'MIN', 422.0, 486.0, '1996', '2017', 908.0),
 ('roberda07', 'Roberts', 'Dave', 'LAN', 302.0, 324.0, '2002', '2017', 626.0),
 ('venturo01', 'Ventura', 'Robin', 'CHA', 1254.0, 810.0, '1989', '2016', 2064.0)]

### Notes, Comments

## Determining Lifespan (10 points)

### Question

1. A person was a player if their playerID appears in ```Lahman2017.appearances.```
<br><br>
1. A person is "known to be dead" if ```people.deathYear``` is NOT ```''``` (the empty string)
<br><br>
1. Return a table that contains the ten players and former players known to be dead with the longest lifespans. The table's rows should contain:
    - playerID
    - nameLast
    - nameFirst
    - DOD (Date of Death) in the format (YYYY-MM-DD)
    - DOB (Date if Birth) in the format (YYYY-MM-DD)
    - lifespan, number of days between DOD and DOB, in days.
<br><br>
1. Your table must match the column names and column values in the sample answer.

### Answer

In [107]:
%%sql
use lahman2017raw;
SELECT playerID, nameLast, nameFirst,
    str_to_date(concat(if(birthMonth='', NULL, birthMonth),'/',
                        if(birthDay='', NULL, birthDay),'/',
                        if(birthYear='', NULL, birthYear)), '%m/%d/%Y') as DOB,
    str_to_date(concat(if(deathMonth='', NULL, deathMonth),'/',
                        if(deathDay='', NULL, deathDay),'/',
                        if(deathYear='', NULL, deathYear)), '%m/%d/%Y') as DOD,
    (-1*datediff(str_to_date(concat(if(birthMonth='', NULL, birthMonth),'/',
                        if(birthDay='', NULL, birthDay),'/',
                        if(birthYear='', NULL, birthYear)),'%m/%d/%Y'),
                str_to_date(concat(if(deathMonth='', NULL, deathMonth),'/',
                        if(deathDay='', NULL, deathDay),'/',
                        if(deathYear='', NULL, deathYear)), '%m/%d/%Y'))) as lifespan
FROM people
WHERE playerid IN (SELECT playerid FROM appearances) 
AND deathYear <> ''
ORDER BY lifespan DESC
LIMIT 10

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
10 rows affected.

[('hoffch01', 'Hoff', 'Red', datetime.date(1891, 5, 8), datetime.date(1998, 9, 17), 39213),
 ('marreco01', 'Marrero', 'Connie', datetime.date(1911, 4, 25), datetime.date(2014, 4, 23), 37619),
 ('wrighbo01', 'Wright', 'Bob', datetime.date(1891, 12, 13), datetime.date(1993, 7, 30), 37119),
 ('parkeac01', 'Parker', 'Ace', datetime.date(1912, 5, 17), datetime.date(2013, 11, 6), 37063),
 ('malinto01', 'Malinosky', 'Tony', datetime.date(1909, 10, 7), datetime.date(2011, 2, 8), 37014),
 ('swanska01', 'Swanson', 'Karl', datetime.date(1900, 12, 17), datetime.date(2002, 4, 3), 36997),
 ('daleyjo01', 'Daley', 'John', datetime.date(1887, 5, 25), datetime.date(1988, 8, 31), 36988),
 ('otisbi01', 'Otis', 'Bill', datetime.date(1889, 12, 24), datetime.date(1990, 12, 15), 36880),
 ('stilero01', 'Stiles', 'Rollie', datetime.date(1906, 11, 17), datetime.date(2007, 7, 22), 36772),
 ('werbebi01', 'Werber', 'Billy', datetime.date(1908, 6, 20), datetime.date(2009, 1, 22), 36741)]

10 rows affected.

[('hoffch01', 'Hoff', 'Red', datetime.date(1891, 5, 8), datetime.date(1998, 9, 17), 39213),
 ('marreco01', 'Marrero', 'Connie', datetime.date(1911, 4, 25), datetime.date(2014, 4, 23), 37619),
 ('wrighbo01', 'Wright', 'Bob', datetime.date(1891, 12, 13), datetime.date(1993, 7, 30), 37119),
 ('parkeac01', 'Parker', 'Ace', datetime.date(1912, 5, 17), datetime.date(2013, 11, 6), 37063),
 ('malinto01', 'Malinosky', 'Tony', datetime.date(1909, 10, 7), datetime.date(2011, 2, 8), 37014),
 ('swanska01', 'Swanson', 'Karl', datetime.date(1900, 12, 17), datetime.date(2002, 4, 3), 36997),
 ('daleyjo01', 'Daley', 'John', datetime.date(1887, 5, 25), datetime.date(1988, 8, 31), 36988),
 ('otisbi01', 'Otis', 'Bill', datetime.date(1889, 12, 24), datetime.date(1990, 12, 15), 36880),
 ('stilero01', 'Stiles', 'Rollie', datetime.date(1906, 11, 17), datetime.date(2007, 7, 22), 36772),
 ('werbebi01', 'Werber', 'Billy', datetime.date(1908, 6, 20), datetime.date(2009, 1, 22), 36741)]

### Notes, Comments

## Odd Hall of Fame Members (10 points)

### Question

1. Use the table ```HallOfFame.``` A person is in the ```HallOfFame``` if there is a row with ```inducted='Y'```
<br><br>
1. A person was a player in __Major League Baseball__ if their ```playerID``` is in ```Appearances``` and a manager if their ```playerID``` is in ```Managers.```
<br><br>
1. Write a query that returns
    - playerID, nameLast, nameFirst, inducted, yearid, category
    - For people in the ```HallOfFame``` who were not players or managers in Major League Baseball.
<br><br>
1. Your answer __MUST__ match the sample answer.

### Answer

In [626]:
%%sql
use lahman2017raw;
SELECT playerID,
    (SELECT nameLast FROM people WHERE people.playerid = HallOfFame.playerid) AS nameLast,
    (SELECT nameFirst FROM people WHERE people.playerid = HallOfFame.playerid) AS nameFirst,
    inducted, yearid, category
FROM HallOfFame
WHERE playerid NOT IN (SELECT playerid FROM appearances)
AND playerid NOT IN (SELECT playerid FROM managers)
ORDER BY yearid asc
LIMIT 10

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.
10 rows affected.

[('bulkemo99', 'Bulkeley', 'Morgan', 'Y', '1937', 'Pioneer/Executive'),
 ('johnsba99', 'Johnson', 'Ban', 'Y', '1937', 'Pioneer/Executive'),
 ('cartwal99', 'Cartwright', 'Alexander', 'Y', '1938', 'Pioneer/Executive'),
 ('chadwhe99', 'Chadwick', 'Henry', 'Y', '1938', 'Pioneer/Executive'),
 ('landike99', 'Landis', 'Kenesaw', 'Y', '1944', 'Pioneer/Executive'),
 ('connoto99', 'Connolly', 'Tommy', 'Y', '1953', 'Umpire'),
 ('klembi99', 'Klem', 'Bill', 'Y', '1953', 'Umpire'),
 ('frickfo99', 'Frick', 'Ford', 'Y', '1970', 'Pioneer/Executive'),
 ('weissge99', 'Weiss', 'George', 'Y', '1971', 'Pioneer/Executive'),
 ('gibsojo99', 'Gibson', 'Josh', 'Y', '1972', 'Player')]

In [15]:
%%sql

10 rows affected.

[('bulkemo99', 'Bulkeley', 'Morgan', 'Y', 'Pioneer/Executive', '1937'),
 ('johnsba99', 'Johnson', 'Ban', 'Y', 'Pioneer/Executive', '1937'),
 ('cartwal99', 'Cartwright', 'Alexander', 'Y', 'Pioneer/Executive', '1938'),
 ('chadwhe99', 'Chadwick', 'Henry', 'Y', 'Pioneer/Executive', '1938'),
 ('landike99', 'Landis', 'Kenesaw', 'Y', 'Pioneer/Executive', '1944'),
 ('connoto99', 'Connolly', 'Tommy', 'Y', 'Umpire', '1953'),
 ('klembi99', 'Klem', 'Bill', 'Y', 'Umpire', '1953'),
 ('frickfo99', 'Frick', 'Ford', 'Y', 'Pioneer/Executive', '1970'),
 ('weissge99', 'Weiss', 'George', 'Y', 'Pioneer/Executive', '1971'),
 ('gibsojo99', 'Gibson', 'Josh', 'Y', 'Player', '1972')]

### Notes, Comments

## Teams that Played in Boston (10 points)

### Question

1. The ```Teams``` table contains information about teams and their seasons. Interesting columns are:
    - ```teamID```
    - ```franchID```
    - ```name```
    - ```park,``` which is the name of the facility (stadium) in which the team played.
<br><br>
1. The ```Parks``` table contains information about park names, their cities and states.
<br><br>
1. JOINing ```Teams``` and ```Parks``` should enable finding teams that played in cities, except the ```Teams``` table and ```Parks``` table sometimes have slightly different names for the park/stadium. This requires matching instead equality.
<br><br>
1. Write a query that returns the ```teamID, franchID, team name, park.name``` from ```Parks``` for all teams that played in Boston.
<br><br>
1. Your answer __MUST__ exactly match the sample answer.

### Answer

In [109]:
%%sql
use lahman2017raw;
SELECT DISTINCT teamid, franchid, a.team_name, b.`park.name`
FROM (SELECT DISTINCT teamid, franchid, name as team_name, park FROM Teams WHERE park != '') as a
JOIN (SELECT * FROM parks) as b
WHERE b.city='Boston' 
AND a.park like concat('%', b.`park.name`, '%')
ORDER BY team_name;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
20 rows affected.

[('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Bees', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Braves', 'Fenway Park'),
 ('BSN', 'ATL', 'Boston Braves', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Red Caps', 'South End Grounds I'),
 ('BOS', 'BOS', 'Boston Red Sox', 'Fenway Park'),
 ('BS1', 'BNA', 'Boston Red Stockings', 'South End Grounds I'),
 ('BS2', 'BRS', 'Boston Reds', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds III')]

In [16]:
%%sql

20 rows affected.

[('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Beaneaters', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Bees', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Braves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Braves', 'Fenway Park'),
 ('BSN', 'ATL', 'Boston Braves', 'Braves Field'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Doves', 'South End Grounds III'),
 ('BSN', 'ATL', 'Boston Red Caps', 'South End Grounds I'),
 ('BOS', 'BOS', 'Boston Red Sox', 'Fenway Park'),
 ('BS1', 'BNA', 'Boston Red Stockings', 'South End Grounds I'),
 ('BS2', 'BRS', 'Boston Reds', 'Congress Street Grounds'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds I'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds II'),
 ('BSN', 'ATL', 'Boston Rustlers', 'South End Grounds III')]

### Notes, Comments

- Two point bonus question: Why would someone name a team in Boston the "Beaneaters?"


- Hint: Below is part of a famous toast,

_"And this is good old Boston, <br>
The home of the bean and the cod. <br>
Where the Lowells talk only to Cabots, <br>
And the Cabots talk only to God."_ <br>
<br>
John Collins Bossidy: A toast given at Holy Cross College alumni dinner in 1910.


- Enter you explanation here.

#### It is because of the prevalence of baked beans in Boston, as known as Beantown. 
Well baked beans do taste good, no wonder people in Boston love them.

# Relational/Document Mapping (15 points)

## Question

### Schema

- Tables: The two tables below represent ```Orders``` and ```OrderDetails```


- ```orderdetails``` is a [Weak Entity](https://en.wikipedia.org/wiki/Weak_entity) that depends on and is logically contained inside an ```order.```

```
CREATE TABLE `orders` (
  `orderNumber` int(11) NOT NULL,
  `orderDate` date NOT NULL,
  `requiredDate` date NOT NULL,
  `shippedDate` date DEFAULT NULL,
  `status` varchar(15) NOT NULL,
  `comments` text,
  `customerNumber` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;


CREATE TABLE `orderdetails` (
  `orderNumber` int(11) NOT NULL,
  `productCode` varchar(15) NOT NULL,
  `quantityOrdered` int(11) NOT NULL,
  `priceEach` decimal(10,2) NOT NULL,
  `orderLineNumber` smallint(6) NOT NULL,
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

```

- You must create the tables in a new schema you create. The schema name is of the form "uni_midterm" Please replace the string "uni" with your UNI. If your answer does do the replacement and your schema is "uni_midterm", we will chuckle and shake our heads.


- You also must define a primary key in each table and any foreign key relationships. ```orderNumber``` is the primary key in ```orders.```

### Question Tasks

1. Create the tables in a schema called `uni_midterm` and replace "uni" with your UNI.
<br><br>
1. Write a python function ```create_order(o)``` that
    1. Takes a data structure like the onea below.
    2. Inserts the order fields in the ```order``` table and the order details information in the ```orderdetails``` table.
    3. There are sample JSON for orders/ordersdetails below.
<br><br>
1. Your code must generate a unique ```orderNumber``` for the created order.
<br><br>
1. The function returns the ```orderNumber``` for the created order.
<br><br>
1. You may modify the table schema if you want.
<br><br>
1. Test your function on the two orders below.
<br><br>
1. Write a SQL query that returns information about an order and its details.

```
{
    "order":
        {
            "orderDate": "2003-01-06",
            "requiredDate": "2003-01-13",
            "shippedDate": "2003-01-10",
            "status": "Shipped",
            "comments": null,
            "customerNumber": 363
        },
    "orderdetails": 
        [
        {
            "productCode": "S24_3969",
            "quantityOrdered": 49,
            "priceEach": "35.29",
            "orderLineNumber": 1
        },
        {
            "productCode": "S18_2248",
            "quantityOrdered": 50,
            "priceEach": "55.09",
            "orderLineNumber": 2
        },
        {
            "productCode": "S18_1749",
            "quantityOrdered": 30,
            "priceEach": "136.00",
            "orderLineNumber": 3
        },
        {
            "productCode": "S18_4409",
            "quantityOrdered": 22,
            "priceEach": "75.46",
            "orderLineNumber": 4
        }
    ]
}
```

```
{
    "order":
        "orderDate": "2003-01-09",
        "requiredDate": "2003-01-18",
        "shippedDate": "2003-01-11",
        "status": "Shipped",
        "comments": "Check on availability.",
        "customerNumber": 128
    }
    "orderdetails": [
    {
            "orderNumber": 10101,
            "productCode": "S18_2795",
            "quantityOrdered": 26,
            "priceEach": "167.06",
            "orderLineNumber": 1
        },
        {
            "orderNumber": 10101,
            "productCode": "S24_2022",
            "quantityOrdered": 46,
            "priceEach": "44.35",
            "orderLineNumber": 2
        },
        {
            "orderNumber": 10101,
            "productCode": "S24_1937",
            "quantityOrdered": 45,
            "priceEach": "32.53",
            "orderLineNumber": 3
        },
        {
            "orderNumber": 10101,
            "productCode": "S18_2325",
            "quantityOrdered": 25,
            "priceEach": "108.06",
            "orderLineNumber": 4
        }
    ]
}
```

## Answer

### Schema and Table Creation

In [281]:
%%sql
CREATE SCHEMA `rs3878_midterm`;
use rs3878_midterm;

CREATE TABLE `orders` (
  `orderNumber` int(11) NOT NULL,
  `orderDate` date NOT NULL,
  `requiredDate` date NOT NULL,
  `shippedDate` date DEFAULT NULL,
  `status` varchar(15) NOT NULL,
  `comments` text,
  `customerNumber` int(11) NOT NULL,
    primary key (`orderNumber`),
    UNIQUE KEY `orderNumber_UNIQUE` (`orderNumber`)
) ENGINE=InnoDB AUTO_INCREMENT=1 CHARSET=utf8MB3;

CREATE TABLE `orderdetails` (
  `orderNumber` int(11) NOT NULL,
  `productCode` varchar(15) NOT NULL,
  `quantityOrdered` int(11) NOT NULL,
  `priceEach` decimal(10,2) NOT NULL,
  `orderLineNumber` smallint(6) NOT NULL,
    constraint `fk_order` foreign key (`orderNumber`) references `orders`(`orderNumber`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8MB3;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1287, "'utf8mb3' is deprecated and will be removed in a future release. Please use utf8mb4 instead")
  result = self._query(query)

[]

### Python Functions

In [282]:
def get_maximum_value(dbname, tablename, key_col, cursor, commit):
    q1 = 'SELECT MAX('+ key_col+') FROM ' + dbname+"."+ tablename
    result1 = run_q(cnx=None, q=q1, args=None, fetch=True)
    if result1[0]['MAX('+key_col+')'] is None:
        return 0
    else:
        return int(result1[0]['MAX('+key_col+')'])

def insert(dbname, tablename, new_r, cnx = None, cursor = None, commit = None, rowid = None):
    #get column names and values
    cols = list(new_r.keys())
    args = [new_r[k] for k in cols]
    slots = ['%s' for c in cols]

    #form query
    cols = " ("+",".join(cols)+") "
    vals = " VALUES ( "+",".join(slots)+") "
    tbl = dbname+"."+tablename
    q = "INSERT INTO "+tbl+ " "+cols + " "+vals
    result = run_q(cnx = cnx, q= q, args = args, commit = commit, rowid=rowid, cursor = cursor)
    return result

def insert_doc(dbname, doc, key_col, cursor = None, commit = None):
    try:
        cnx = get_connection(c_name=None)
        cursor = cnx.cursor()
        #get a list of table to use
        keys = list(doc.keys())
        #parent table, get max value of key
        pk = keys[0]
        max_v = get_maximum_value(dbname, keys[0], key_col, cursor = cursor, commit = False)
        
        print('max_v = ', max_v)
        #increment key value
        max_v += 1
        root = doc[keys[0]]
        root[key_col] = max_v
        
        #insert parent row,
        r = insert(dbname, keys[0], doc[keys[0]], cursor = cursor, commit = False)

        #for every child table
        for k in keys[1:]:
            tbl = doc[k]

            #for every row in child table
            for r in tbl:
                #set foreign key
                r[key_col] = max_v
                tmp = insert(dbname, k, r, cursor = cursor, commit = False)

        cnx.commit()
        cnx.close()
        return max_v
    except Exception as e:
        print("Exception = ", e)
        #cnx.commit()

### Tests

We __MAY__ test your code and SQL statements.

#### Test Data

In [21]:
o_all_1 = {
    "orders":
        {
            "orderDate": "2003-01-06",
            "requiredDate": "2003-01-13",
            "shippedDate": "2003-01-10",
            "status": "Shipped",
            "comments": None,
            "customerNumber": 363
        },
    "orderdetails": 
        [
        {
            "productCode": "S24_3969",
            "quantityOrdered": 49,
            "priceEach": "35.29",
            "orderLineNumber": 1
        },
        {
            "productCode": "S18_2248",
            "quantityOrdered": 50,
            "priceEach": "55.09",
            "orderLineNumber": 2
        },
        {
            "productCode": "S18_1749",
            "quantityOrdered": 30,
            "priceEach": "136.00",
            "orderLineNumber": 3
        },
        {
            "productCode": "S18_4409",
            "quantityOrdered": 22,
            "priceEach": "75.46",
            "orderLineNumber": 4
        }
    ]
}

In [283]:
o_all_2 = {
    "orders":
        {
            "orderDate": "2003-01-06",
            "requiredDate": "2003-01-13",
            "shippedDate": "2003-01-10",
            "status": "Shipped",
            "comments": None,
            "customerNumber": 363
        },
    "orderdetails": 
        [
        {
            "productCode": "S24_3969",
            "quantityOrdered": 49,
            "priceEach": "35.29",
            "orderLineNumber": 1
        },
        {
            "productCode": "S18_2248",
            "quantityOrdered": 50,
            "priceEach": "55.09",
            "orderLineNumber": 2
        },
        {
            "productCode": "S18_1749",
            "quantityOrdered": 30,
            "priceEach": "136.00",
            "orderLineNumber": 3
        },
        {
            "productCode": "S18_4409",
            "quantityOrdered": 22,
            "priceEach": "75.46",
            "orderLineNumber": 4
        }
    ]
}

#### Test Execution

In [284]:
%%sql
select * FROM rs3878_midterm.orders join rs3878_midterm.orderdetails using(orderNumber)

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [285]:
r = insert_doc('rs3878_midterm', o_all_1, 'orderNumber')
print(r)

max_v =  0
1

In [286]:
%%sql
select * FROM rs3878_midterm.orders join rs3878_midterm.orderdetails using(orderNumber)

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
4 rows affected.

[(1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1),
 (1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4)]

In [287]:
r = insert_doc('rs3878_midterm', o_all_2, 'orderNumber')
print(r)

max_v =  1
2

In [288]:
%%sql
select * FROM rs3878_midterm.orders join rs3878_midterm.orderdetails using(orderNumber)

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
8 rows affected.

[(1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1),
 (1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (1, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4),
 (2, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S24_3969', 49, Decimal('35.29'), 1),
 (2, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_2248', 50, Decimal('55.09'), 2),
 (2, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_1749', 30, Decimal('136.00'), 3),
 (2, datetime.date(2003, 1, 6), datetime.date(2003, 1, 13), datetime.date(2003, 1, 10), 'Shipped', None, 363, 'S18_4409', 22, Decimal('75.46'), 4)]

#### SQL Query

## Notes, Comments

# Data Modeling (15 points)

## Question

- __Note:__ Use the schema uni_midterm for these tables.


- The _Contact_ application's conceptual data model has the following _conceptual entities and properties._ 


- The properties in the _conceptual model do not necessarily map directly to columns_ in the _logical_ and _physical_ models.


- _Person:_

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 21 | Auto-incremented; primary key |
| Name | String | "Donald Ferguson" | |
| Created | Datetime | 2019-03-06 10:51:59 | |


<br>
- _Email:_ 

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 21 | Auto-incremented; primary key |
| email | String | "dff9@mars.gov" | |


<br><br>
- _Phone:_ 

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 11 | Auto-incremented; primary key |
| Phone | String | "+1 914-555-1212" | |

<br>
<br>
- _Address:_ 

| Property | Type | Example | Comments |
| :---: | :---: |
| id | Integer | 101 | Auto-incremented; primary key |
| Street | String | "620 W. 120th Street" | |
| City | String | "Boston" | |
| State | String | "MA" | |
| Country | String | "France" |
| Postcode | String | "12345" |


- _Contact Types:_ These represents the types of relationships. There can be __at most__ one instance of the relationship between a person and a contact type. For example, a person can have at most one _business email._ The predefined contact types are:
    - _Personal_
    - _Business_
    - _Home_
    - _Other_
    
    
- A _Person_ may have have contacts of more than one type, and a specific contact entity may apply to more than one person.
    
    
- Define and implement a physical schema that realizes the model.
    - Define the tables.
    - Create the reverse engineered model into a diagram.

## Answer

- Your diagram and table create statements go here.

In [ ]:
%%sql
use rs3878_midterm;
CREATE TABLE `persons`(
    `person_id` int(11) NOT NULL AUTO_INCREMENT,
    `last_name` varchar(128) NOT NULL,
    `first_name` varchar(128) NOT NULL,
    `person_created` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP,    
    PRIMARY KEY (`person_id`)
) ENGINE = InnoDB DEFAULT CHARSET = latin1; 

CREATE TABLE `phoneinfos`(
    `phone_info_id` int(11) NOT NULL AUTO_INCREMENT,
    `country_code` int(11) NOT NULL,
    `phone_number` varchar(45) NOT NULL,
    PRIMARY KEY (`phone_info_id`)
) ENGINE = InnoDB DEFAULT CHARSET = latin1; 

CREATE TABLE `person_phone`(
    `person_id` int(11) NOT NULL,
    `phone_id` int(11) NOT NULL,
    `kind` enum('PERSONAL','HOME','BUSINESS','OTHER') CHARACTER SET utf8 NOT NULL,
    PRIMARY KEY (`person_id`,`phone_id`, `kind`),
    KEY `p_to_ph_idx`(`phone_id`),
    CONSTRAINT `p_to_per` FOREIGN KEY (`person_id`) REFERENCES `persons`(`person_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION,
    CONSTRAINT `p_to_ph` FOREIGN KEY (`phone_id`) REFERENCES `phoneinfos`(`phone_info_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = latin1; 

CREATE TABLE `emails`(
    `email_id` int(11) NOT NULL,
    `email_value` varchar(128) CHARACTER SET utf8 NOT NULL,
    PRIMARY KEY(`email_id`)
) ENGINE = InnoDB DEFAULT CHARSET = latin1; 

CREATE TABLE `person_email`(
    `person_id` int(11) NOT NULL,
    `email_id` int(11) NOT NULL,
    `kind` enum('PERSONAL','HOME','BUSINESS','OTHER') CHARACTER SET utf8 NOT NULL,
    PRIMARY KEY (`person_id`,`email_id`, `kind`),
    KEY `e_to_e_idx`(`email_id`),
    CONSTRAINT `e_to_e` FOREIGN KEY (`email_id`) REFERENCES `emails`(`email_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION,
    CONSTRAINT `e_to_p` FOREIGN KEY (`person_id`) REFERENCES `persons`(`person_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = latin1; 

CREATE TABLE `postalcodes`(
    `postal_code_id` int(11) NOT NULL AUTO_INCREMENT,
    `postal_code` varchar(45) NOT NULL,
    `city_code` int(11) NOT NULL,
    `state_code` int(11) NOT NULL,
    `country_code` varchar(4) NOT NULL,
    PRIMARY KEY (`postal_code_id`),
    KEY `pc_to_country_idx`(`country_code`),
    KEY `pc_to_state_idx`(`state_code`),
    KEY `pc_to_city_idx`(`city_code`)
) ENGINE = InnoDB DEFAULT CHARSET = utf8MB3; 

CREATE TABLE `addresses`(
    `address_id` int(11) NOT NULL,
    `street1` varchar(128) NOT NULL,
    `street2` varchar(128) NOT NULL,
    `postal_code` int(11) NOT NULL,
    PRIMARY KEY(`address_id`),
    KEY `addr_to_pc_idx` (`postal_code`),
    CONSTRAINT `addr_to_pc` FOREIGN KEY (`postal_code`) REFERENCES `postalcodes`(`postal_code_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = utf8MB3;

In [292]:
%%sql
use rs3878_midterm;
CREATE TABLE `person_address`(
    `person_id` int(11) NOT NULL,
    `address_id` int(11) NOT NULL,
    `kind` enum('PERSONAL','HOME','BUSINESS','OTHER') CHARACTER SET utf8 NOT NULL,
    PRIMARY KEY (`person_id`,`address_id`, `kind`),
    KEY `add_to_add_idx`(`address_id`),
    CONSTRAINT `add_to_add` FOREIGN KEY (`address_id`) REFERENCES `addresses`(`address_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION,
    CONSTRAINT `add_to_p` FOREIGN KEY (`person_id`) REFERENCES `persons`(`person_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = latin1; 

CREATE TABLE `countries`(
    `Name` varchar(128) NOT NULL,
    `Code` varchar(4) NOT NULL,
    PRIMARY KEY(`Code`),
    UNIQUE KEY `name_UNIQUE` (`Name`),
    CONSTRAINT `country_to_pc` FOREIGN KEY (`Code`) REFERENCES `postalcodes`(`country_code`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = utf8MB3; 

CREATE TABLE `states`(
    `state_id` int(11) NOT NULL AUTO_INCREMENT,
    `state_name` varchar(128) NOT NULL,
    `country_code` varchar(4) NOT NULL,
    PRIMARY KEY(`state_id`),
    KEY `s_to_c_idx` (`country_code`),
    CONSTRAINT `s_to_c` FOREIGN KEY (`country_code`) REFERENCES `countries`(`Code`)
    ON DELETE NO ACTION ON UPDATE NO ACTION,
    CONSTRAINT `state_to_pc` FOREIGN KEY (`state_id`) REFERENCES `postalcodes`(`state_code`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = utf8MB3; 

CREATE TABLE `cities`(
    `city_id` int(11) NOT NULL AUTO_INCREMENT,
    `city_name` varchar(128) NOT NULL,
    `country_code` varchar(4) NOT NULL,
    `state_code` int(11) NOT NULL,
    PRIMARY KEY(`city_id`),
    KEY `c_to_s_idx` (`state_code`),
    CONSTRAINT `c_to_s` FOREIGN KEY (`state_code`) REFERENCES `states`(`state_id`)
    ON DELETE NO ACTION ON UPDATE NO ACTION,
    CONSTRAINT `city_to_pc` FOREIGN KEY (`city_id`) REFERENCES `postalcodes`(`city_code`)
    ON DELETE NO ACTION ON UPDATE NO ACTION
) ENGINE = InnoDB DEFAULT CHARSET = utf8MB3;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

![caption](erdiagram.png)

## Notes and Comments

# Data Cleanse (15 points)

## Question

- Importing raw data from CSV files and other sources is very common in all disciplines that use databases. 


- Data science, analytics and general application development regularly require cleaning up the raw data.


- ```People``` from Lahman2017 is an example of raw data that requires schema and data cleanup. The table definition that the MySql import tool produces is below.


- Convert the table to a cleaner, more useful form. You do not need to worry about other tables and foreign keys. This means:
    - Change the schema (column types, constraints, etc)
    - You may have to consolidate columns, add columns and drop columns.
    - Modify the data to match the schema.
    - Run a query with limit 10 to show the transformed date and schema.


- Do not ask, "How many improvements are necessary?" The answer is, "All of them."

```
CREATE TABLE `People` (
  `playerID` text,
  `birthYear` text,
  `birthMonth` text,
  `birthDay` text,
  `birthCountry` text,
  `birthState` text,
  `birthCity` text,
  `deathYear` text,
  `deathMonth` text,
  `deathDay` text,
  `deathCountry` text,
  `deathState` text,
  `deathCity` text,
  `nameFirst` text,
  `nameLast` text,
  `nameGiven` text,
  `weight` text,
  `height` text,
  `bats` text,
  `throws` text,
  `debut` text,
  `finalGame` text,
  `retroID` text,
  `bbrefID` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

```

- Implement the cleanup. This involves:
    - Providing your final table definition.
    - SQL statements you used to probe/examine the data.
    - SQL statements you used to transform the data to comply with the new table definition.
    

## Answer

- The answer below contains the SQL statements you used to
    - Probe the data for understanding.
    - Alter data in the database.
    - Modify the schema.


- We __MAY__ test your SQL.

In [389]:
%%sql
use lahman2017raw;
create table `peopleclean`(
select * from lahman2017raw.people
)

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
19370 rows affected.

[]

First I will analyze columns to determine a primary key

In [390]:
%%sql
select count(*) as total_rows, 
    count(distinct playerid) as count_playerid,
    count(distinct nameLast) as count_nameLast,
    count(distinct bats) as count_bats,
    count(distinct retroid) as count_retroid,
    count(distinct bbrefid) as count_bbrefid
    from peopleclean;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[(19370, 19370, 9930, 4, 19315, 19370)]

In [391]:
%%sql
use lahman2017raw;
select * from information_schema.columns
    where table_schema='lahman2017raw'
    and column_name in('playerid','bbrefid')

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
25 rows affected.

[('def', 'lahman2017Raw', 'AllstarFull', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'Appearances', 'playerID', 4, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'AwardsManagers', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'AwardsPlayers', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'AwardsShareManagers', 'playerID', 4, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'AwardsSharePlayers', 'playerID', 4, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'batting', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'BattingPost', 'playerID', 3, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'CollegePlaying', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'Fielding', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'FieldingOF', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'FieldingOFsplit', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'FieldingPost', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'HallOfFame', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'Managers', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'ManagersHalf', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'People', 'bbrefID', 24, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'People', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'peopleclean', 'bbrefID', 24, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'peopleclean', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'peopleclean2', 'bbrefID', 24, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'peopleclean2', 'playerid', 1, None, 'NO', 'varchar', 16, 48, None, None, None, 'utf8', 'utf8_general_ci', 'varchar(16)', 'PRI', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'Pitching', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'PitchingPost', 'playerID', 1, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None),
 ('def', 'lahman2017Raw', 'Salaries', 'playerID', 4, None, 'YES', 'text', 65535, 65535, None, None, None, 'utf8', 'utf8_general_ci', 'text', '', '', 'select,insert,update,references', '', '', None)]

Analysis: therefore, according to the distinct counts, I will set playerid as its primary key. What's more, it could be used as foreign key for other tables such as batting, fielding while those tables don't have a key called bbrefid

In [392]:
%%sql
select max(length(playerid)) from peopleclean;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[(9,)]

In [393]:
%%sql
select max(length(nameFirst)),max(length(nameLast)),max(length(nameGiven)) from peopleclean;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[(12, 14, 43)]

In [394]:
%%sql
update peopleclean set nameFirst=null where nameFirst ="";
update peopleclean set nameLast=null where nameLast ='';
update peopleclean set nameGiven=null where nameGiven ='';
update peopleclean set deathYear=NULL where deathYear="";
update peopleclean set deathMonth=NULL where deathMonth="";
update peopleclean set deathDay=NULL where deathDay="";
update peopleclean set deathCountry=NULL where deathCountry="";
update peopleclean set deathState=NULL where deathState="";
update peopleclean set deathCity=NULL where deathCity="";
update peopleclean set height=null where height = '';
update peopleclean set weight=null where weight = '';
update peopleclean set throws=null where throws ="";
update peopleclean set bats=null where bats ="";
update peopleclean set debut = null where debut="";
update peopleclean set finalGame = null where finalGame = "";

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
38 rows affected.
0 rows affected.
38 rows affected.
9820 rows affected.
9821 rows affected.
9822 rows affected.
9825 rows affected.
9871 rows affected.
9830 rows affected.
755 rows affected.
837 rows affected.
979 rows affected.
1185 rows affected.
196 rows affected.
196 rows affected.

[]

In [395]:
%%sql
alter table `lahman2017raw`.`peopleclean`
change column `playerid` `playerid` varchar(12) not null,
add primary key(`playerid`);
alter table `lahman2017raw`.`peopleclean`
change column `nameFirst` `nameFirst` varchar(16) null default null;
alter table `lahman2017raw`.`peopleclean`
change column `nameLast` `nameLast` varchar(16) null default null;
alter table `lahman2017raw`.`peopleclean`
change column `nameGiven` `nameGiven` varchar(45) null default null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
19370 rows affected.
19370 rows affected.
19370 rows affected.
19370 rows affected.

[]

In [396]:
%%sql
select count(distinct birthDay) as count_b_day,
    count(distinct birthMonth) as count_b_month,
    count(distinct birthYear) as count_b_year
    from lahman2017raw.people;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[(32, 13, 167)]

In [397]:
%%sql
select distinct birthDay from lahman2017raw.people;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
32 rows affected.

[('27',),
 ('5',),
 ('8',),
 ('25',),
 ('17',),
 ('4',),
 ('15',),
 ('11',),
 ('14',),
 ('16',),
 ('22',),
 ('19',),
 ('2',),
 ('18',),
 ('31',),
 ('30',),
 ('23',),
 ('6',),
 ('1',),
 ('28',),
 ('9',),
 ('24',),
 ('29',),
 ('13',),
 ('7',),
 ('26',),
 ('10',),
 ('21',),
 ('20',),
 ('',),
 ('3',),
 ('12',)]

In [398]:
%%sql
use lahman2017raw;
alter table peopleclean add DOB date after playerid;
alter table peopleclean add DOD date after birthCity;

update peopleclean set DOB=str_to_date(concat(if(birthMonth='', NULL, birthMonth),'/',
                        if(birthDay='', NULL, birthDay),'/',
                        if(birthYear='', NULL, birthYear)), '%m/%d/%Y');
update peopleclean set DOD=str_to_date(concat(if(deathMonth='', NULL, deathMonth),'/',
                        if(deathDay='', NULL, deathDay),'/',
                        if(deathYear='', NULL, deathYear)), '%m/%d/%Y');

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
0 rows affected.
0 rows affected.
19370 rows affected.
19370 rows affected.

[]

In [399]:
%%sql
use lahman2017raw;
alter table peopleclean 
drop column birthYear, drop column birthDay, 
drop column birthMonth,drop column deathYear,
drop column deathDay, drop column deathMonth;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
0 rows affected.

[]

saving country names to a separate table would save a lot of space.

In [401]:
%%sql
create table `lahman2017raw`.`countries` (
`country_code` int not null auto_increment,
`countryName` varchar(45) not null,
primary key (`country_code`)
) ENGINE = InnoDB DEFAULT CHARSET=utf8MB3;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1287, "'utf8mb3' is deprecated and will be removed in a future release. Please use utf8mb4 instead")
  result = self._query(query)

[]

In [402]:
%%sql
use lahman2017raw;
insert into countries (countryName)
    select country_name from
        ((select distinct birthCountry as country_name from peopleclean where birthCountry is not NULL)
        union
        (select distinct deathCountry as country_name from peopleclean where deathCountry is not NULL)) as c;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
59 rows affected.

[]

In [403]:
%%sql
alter table `lahman2017raw`.`peopleclean`
add column `birth_country_code` int null after `bbrefid`,
add column `death_country_code` int null after `birth_country_code`;

update peopleclean
    set birth_country_code = 
    (select country_code from countries where countries.countryName = peopleclean.birthCountry);
update peopleclean
    set death_country_code = 
    (select country_code from countries where countries.countryName = peopleclean.deathCountry);
    
update peopleclean
    set birth_country_code= null where birthCountry = '';
update peopleclean
    set death_country_code= null where deathCountry = '';

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
19370 rows affected.
19370 rows affected.
68 rows affected.
0 rows affected.

[]

In [404]:
%%sql
alter table peopleclean
add index `p_to_country_idx` (`birth_country_code` ASC);

alter table peopleclean
add constraint `d_to_country_idx` 
foreign key (`death_country_code`)
references `lahman2017raw`.`countries` (`country_code`)
on delete no action
on update no action;

alter table peopleclean
add constraint `p_to_country_code`
foreign key (`birth_country_code`)
references `lahman2017raw`.`countries` (`country_code`)
on delete no action
on update no action;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
19370 rows affected.
19370 rows affected.

[]

Then we will do the same for states and cities

In [406]:
%%sql
create table states as
select distinct * from
    (select birth_country_code as country_code, birthState as state_name from peopleclean
    union
    select death_country_code as country_code, deathState as state_name from peopleclean) as a;
    
alter table states
add column `state_id` int not null auto_increment after `state_name`,
add primary key (`state_id`);

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
346 rows affected.
0 rows affected.

[]

In [621]:
%%sql
alter table states
add constraint `state_to_country_idx` 
foreign key (`country_code`)
references `lahman2017raw`.`countries` (`country_code`)
on delete no action
on update no action;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
346 rows affected.

[]

In [407]:
%%sql
alter table `lahman2017raw`.`peopleclean`
add column `birth_state_code` int null after `bbrefid`,
add column `death_state_code` int null after `birth_country_code`;

update peopleclean set
birth_state_code = (select state_id from states where states.state_name = peopleclean.birthState
                   and states.country_code = peopleclean.birth_country_code);
update peopleclean set
death_state_code = (select state_id from states where states.state_name = peopleclean.deathState
                   and states.country_code = peopleclean.death_country_code);

update peopleclean
    set birth_state_code= null where birthState = '';
update peopleclean
    set death_state_code= null where deathState = '';

alter table peopleclean 
drop column birthCountry, drop column birthState, 
drop column deathCountry, drop column deathState;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
19370 rows affected.
19370 rows affected.
524 rows affected.
0 rows affected.
0 rows affected.

[]

In [615]:
%%sql
alter table peopleclean
add constraint `d_to_state_idx` 
foreign key (`death_state_code`)
references `lahman2017raw`.`states` (`state_id`)
on delete no action
on update no action;

alter table peopleclean
add constraint `p_to_state_idx`
foreign key (`birth_state_code`)
references `lahman2017raw`.`states` (`state_id`)
on delete no action
on update no action;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
19370 rows affected.
19370 rows affected.

[]

Then cities

In [408]:
%%sql
create table cities as
select distinct * from 
    (select birth_country_code as country_code, birth_state_code as state_code, birthCity as city from peopleclean
    union
    select death_country_code as country_code, death_state_code as state_code, deathCity as city from peopleclean) 
    as a;
    
alter table cities
add column `city_id` int not null auto_increment after `state_code`,
add primary key (`city_id`);

update peopleclean set birthCity=null where birthCity = '';
update peopleclean set deathCity=null where deathCity = '';

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
7431 rows affected.
0 rows affected.
179 rows affected.
0 rows affected.

[]

In [409]:
%%sql
alter table cities
change column `country_code` `country_code` int(11) null default null,
change column `state_code` `state_code` int(11) null default null,
change column `city` `city` mediumtext null default null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [622]:
%%sql
alter table cities
add constraint `city_to_country_idx` 
foreign key (`country_code`)
references `lahman2017raw`.`countries` (`country_code`)
on delete no action
on update no action;

alter table cities
add constraint `city_to_state_idx` 
foreign key (`state_code`)
references `lahman2017raw`.`states` (`state_id`)
on delete no action
on update no action;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
7431 rows affected.
7431 rows affected.

[]

In [617]:
%sql select * from peopleclean limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
   mysql+pymysql://dbuser:***@localhost/rs3878_midterm
10 rows affected.

[('aardsda01', datetime.date(1981, 12, 27), None, 'David', 'Aardsma', 'David Allan', 215, 75, 'R', 'R', datetime.date(2004, 4, 6), datetime.date(2015, 8, 23), 'aardd001', 'aardsda01', 1, 1, 1, None, None, None, 4156, 27.52),
 ('aaronha01', datetime.date(1934, 2, 5), None, 'Hank', 'Aaron', 'Henry Louis', 180, 72, 'R', 'R', datetime.date(1954, 4, 13), datetime.date(1976, 10, 3), 'aaroh101', 'aaronha01', 2, 2, 1, None, None, None, 8209, 25.0),
 ('aaronto01', datetime.date(1939, 8, 5), datetime.date(1984, 8, 16), 'Tommie', 'Aaron', 'Tommie Lee', 190, 75, 'R', 'R', datetime.date(1962, 4, 10), datetime.date(1971, 9, 26), 'aarot101', 'aaronto01', 2, 2, 1, 13, 11, 1, 3456, 24.32),
 ('aasedo01', datetime.date(1954, 9, 8), None, 'Don', 'Aase', 'Donald William', 190, 75, 'R', 'R', datetime.date(1977, 7, 26), datetime.date(1990, 10, 3), 'aased001', 'aasedo01', 3, 3, 1, None, None, None, 4817, 24.32),
 ('abadan01', datetime.date(1972, 8, 25), None, 'Andy', 'Abad', 'Fausto Andres', 184, 73, 'L', 'L', datetime.date(2001, 9, 10), datetime.date(2006, 4, 13), 'abada001', 'abadan01', 4, 4, 1, None, None, None, 1676, 24.8602),
 ('abadfe01', datetime.date(1985, 12, 17), None, 'Fernando', 'Abad', 'Fernando Antonio', 220, 73, 'L', 'L', datetime.date(2010, 7, 28), datetime.date(2017, 10, 1), 'abadf001', 'abadfe01', 5, 5, 2, None, None, None, 2622, 29.7242),
 ('abadijo01', datetime.date(1850, 11, 4), datetime.date(1905, 5, 17), 'John', 'Abadie', 'John W.', 192, 72, 'R', 'R', datetime.date(1875, 4, 26), datetime.date(1875, 6, 10), 'abadj101', 'abadijo01', 6, 6, 1, 6117, 29, 1, 45, 26.6667),
 ('abbated01', datetime.date(1877, 4, 15), datetime.date(1957, 1, 6), 'Ed', 'Abbaticchio', 'Edward James', 170, 71, 'R', 'R', datetime.date(1897, 9, 4), datetime.date(1910, 9, 15), 'abbae101', 'abbated01', 7, 6, 1, 587, 4, 1, 4758, 24.2809),
 ('abbeybe01', datetime.date(1869, 11, 11), datetime.date(1962, 6, 11), 'Bert', 'Abbey', 'Bert Wood', 175, 71, 'R', 'R', datetime.date(1892, 6, 14), datetime.date(1896, 9, 23), 'abbeb101', 'abbeybe01', 8, 7, 1, 1751, 7, 1, 1562, 24.995),
 ('abbeych01', datetime.date(1866, 10, 14), datetime.date(1926, 4, 27), 'Charlie', 'Abbey', 'Charles S.', 169, 68, 'L', 'L', datetime.date(1893, 8, 16), datetime.date(1897, 8, 19), 'abbec101', 'abbeych01', 9, 8, 1, 115, 3, 1, 1464, 26.3149)]

In [410]:
%%sql
use lahman2017raw;
alter table peopleclean add birth_city_code int(11) after bbrefid;
alter table peopleclean add death_city_code int(11) after birth_country_code;

update peopleclean set
birth_city_code = (select city_id from cities where cities.state_code = peopleclean.birth_state_code
                   and cities.country_code = peopleclean.birth_country_code and cities.city = peopleclean.birthCity);
update peopleclean set
death_city_code = (select city_id from cities where cities.state_code = peopleclean.death_state_code
                   and cities.country_code = peopleclean.death_country_code and cities.city = peopleclean.deathCity);

alter table peopleclean drop column birthCity, drop column deathCity;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
0 rows affected.
0 rows affected.
19370 rows affected.
19370 rows affected.
0 rows affected.

[]

In [ ]:
%%sql
alter table peopleclean
add constraint `d_to_city_idx` 
foreign key (`death_city_code`)
references `lahman2017raw`.`cities` (`city_id`)
on delete no action
on update no action;

alter table peopleclean
add constraint `p_to_city_idx`
foreign key (`birth_city_code`)
references `lahman2017raw`.`cities` (`city_id`)
on delete no action
on update no action;

In [411]:
%%sql
select weight,height from peopleclean where
(not height REGEXP '^[0-9]' and height is not null) or 
(not weight REGEXP '^[0-9]' and weight is not null)

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [412]:
%%sql
alter table `lahman2017raw`.`peopleclean`
change column `weight` `weight` int(11) null,
change column `height` `height` int(11) null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
19370 rows affected.

[]

In [413]:
%%sql
ALTER TABLE peopleclean 
ADD career_length INT GENERATED ALWAYS AS (DATEDIFF(cast(finalGame as date), cast(debut as date)));

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [414]:
%%sql
ALTER TABLE peopleclean 
ADD BMI float GENERATED ALWAYS AS (weight*0.45/(height*0.025)/(height*0.025))

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [416]:
%%sql
select playerid, throws from lahman2017raw.peopleclean
where throws not in ('L','R','B',"") and throws is not null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[('vendipa01', 'S')]

In [419]:
%%sql
update peopleclean
set throws='B' where throws='S';

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[]

In [420]:
%%sql
alter table peopleclean
change column `throws` `throws` enum('L','R','B') null default null,
change column `bats` `bats` enum('L','R','B') null default null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
19370 rows affected.

[]

In [422]:
%%sql
alter table peopleclean
change column `debut` `debut` date null default null,
change column `finalGame` `finalGame` date null default null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
19370 rows affected.

[]

In [426]:
%%sql
select max(length(retroid)),max(length(bbrefid)) from peopleclean;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
1 rows affected.

[(8, 9)]

In [427]:
%%sql
alter table peopleclean
change column `retroid` `retroid` varchar(12) null default null,
change column `bbrefid` `bbrefid` varchar(12) null default null;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
19370 rows affected.

[]

In [428]:
%%sql 
select * from peopleclean limit 10;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
10 rows affected.

[('aardsda01', datetime.date(1981, 12, 27), None, 'David', 'Aardsma', 'David Allan', 215, 75, 'R', 'R', datetime.date(2004, 4, 6), datetime.date(2015, 8, 23), 'aardd001', 'aardsda01', 1, 1, 1, None, None, None, 4156, 27.52),
 ('aaronha01', datetime.date(1934, 2, 5), None, 'Hank', 'Aaron', 'Henry Louis', 180, 72, 'R', 'R', datetime.date(1954, 4, 13), datetime.date(1976, 10, 3), 'aaroh101', 'aaronha01', 2, 2, 1, None, None, None, 8209, 25.0),
 ('aaronto01', datetime.date(1939, 8, 5), datetime.date(1984, 8, 16), 'Tommie', 'Aaron', 'Tommie Lee', 190, 75, 'R', 'R', datetime.date(1962, 4, 10), datetime.date(1971, 9, 26), 'aarot101', 'aaronto01', 2, 2, 1, 13, 11, 1, 3456, 24.32),
 ('aasedo01', datetime.date(1954, 9, 8), None, 'Don', 'Aase', 'Donald William', 190, 75, 'R', 'R', datetime.date(1977, 7, 26), datetime.date(1990, 10, 3), 'aased001', 'aasedo01', 3, 3, 1, None, None, None, 4817, 24.32),
 ('abadan01', datetime.date(1972, 8, 25), None, 'Andy', 'Abad', 'Fausto Andres', 184, 73, 'L', 'L', datetime.date(2001, 9, 10), datetime.date(2006, 4, 13), 'abada001', 'abadan01', 4, 4, 1, None, None, None, 1676, 24.8602),
 ('abadfe01', datetime.date(1985, 12, 17), None, 'Fernando', 'Abad', 'Fernando Antonio', 220, 73, 'L', 'L', datetime.date(2010, 7, 28), datetime.date(2017, 10, 1), 'abadf001', 'abadfe01', 5, 5, 2, None, None, None, 2622, 29.7242),
 ('abadijo01', datetime.date(1850, 11, 4), datetime.date(1905, 5, 17), 'John', 'Abadie', 'John W.', 192, 72, 'R', 'R', datetime.date(1875, 4, 26), datetime.date(1875, 6, 10), 'abadj101', 'abadijo01', 6, 6, 1, 6117, 29, 1, 45, 26.6667),
 ('abbated01', datetime.date(1877, 4, 15), datetime.date(1957, 1, 6), 'Ed', 'Abbaticchio', 'Edward James', 170, 71, 'R', 'R', datetime.date(1897, 9, 4), datetime.date(1910, 9, 15), 'abbae101', 'abbated01', 7, 6, 1, 587, 4, 1, 4758, 24.2809),
 ('abbeybe01', datetime.date(1869, 11, 11), datetime.date(1962, 6, 11), 'Bert', 'Abbey', 'Bert Wood', 175, 71, 'R', 'R', datetime.date(1892, 6, 14), datetime.date(1896, 9, 23), 'abbeb101', 'abbeybe01', 8, 7, 1, 1751, 7, 1, 1562, 24.995),
 ('abbeych01', datetime.date(1866, 10, 14), datetime.date(1926, 4, 27), 'Charlie', 'Abbey', 'Charles S.', 169, 68, 'L', 'L', datetime.date(1893, 8, 16), datetime.date(1897, 8, 19), 'abbec101', 'abbeych01', 9, 8, 1, 115, 3, 1, 1464, 26.3149)]

In [429]:
%%sql
show columns in peopleclean;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
22 rows affected.

[('playerid', 'varchar(12)', 'NO', 'PRI', None, ''),
 ('DOB', 'date', 'YES', '', None, ''),
 ('DOD', 'date', 'YES', '', None, ''),
 ('nameFirst', 'varchar(16)', 'YES', '', None, ''),
 ('nameLast', 'varchar(16)', 'YES', '', None, ''),
 ('nameGiven', 'varchar(45)', 'YES', '', None, ''),
 ('weight', 'int(11)', 'YES', '', None, ''),
 ('height', 'int(11)', 'YES', '', None, ''),
 ('bats', "enum('L','R','B')", 'YES', '', None, ''),
 ('throws', "enum('L','R','B')", 'YES', '', None, ''),
 ('debut', 'date', 'YES', '', None, ''),
 ('finalGame', 'date', 'YES', '', None, ''),
 ('retroid', 'varchar(12)', 'YES', '', None, ''),
 ('bbrefid', 'varchar(12)', 'YES', '', None, ''),
 ('birth_city_code', 'int(11)', 'YES', '', None, ''),
 ('birth_state_code', 'int(11)', 'YES', '', None, ''),
 ('birth_country_code', 'int(11)', 'YES', 'MUL', None, ''),
 ('death_city_code', 'int(11)', 'YES', '', None, ''),
 ('death_state_code', 'int(11)', 'YES', '', None, ''),
 ('death_country_code', 'int(11)', 'YES', 'MUL', None, ''),
 ('career_length', 'int(11)', 'YES', '', None, 'VIRTUAL GENERATED'),
 ('BMI', 'float', 'YES', '', None, 'VIRTUAL GENERATED')]

![caption](peopleclean_diagram.png)

## Notes and Comments

# Inheritance, Triggers and Stored Procedures (15 points)

## Question

- The last lecture covered a 3 table solution to inheritance for ```Person, Student``` and ```Faculty.```


- The entity types are the following:


- _Person:_

| Property | Type | Example | Comments |
| :---: | :---: |
| uni | varchar | "dff9" | Computed by database functions; immutable. |
| last_name | varchar | "Ferguson" | |
| first_name | varchar | "Donald" | |
| type | enum("Student", "Faculty", "Multiple") | "Student" | |
| created | Datetime | 2019-03-06 10:51:59 | Immutable. Generated on create. |


- _Faculty:_ A faculty entity is a subclass ("IsA") _Person_ and has all of the properties of _Person._ _Faculty_ has the following additional properties.

| Property | Type | Example | Comments |
| :---: | :---: |
| title | varchar | "Terrifying database professor" | |
| department | varchar | "Computer Science" | |


- _Student:_ A student entity is a subclass ("IsA") _Person_ and has all of the properties of _Person._ _Student_ has the following additional properties.

| Property | Type | Example | Comments |
| :---: | :---: |
| enrollment_year | Date | 2019-09-01 | |
| major | varchar | "Computer Science, but seriously reevaluating life choices and probably changing because of W4111. Yak herding looks pretty good now." | |



- Requirements
    - Solve the problem using a [two table solution.](https://www.vertabelo.com/blog/technical-articles/inheritance-in-a-relational-database)
    - The model is __COMPLETE.__ There are no _Person_ entities that are neither _Student_ or _Faculty._
    - The model is __NOT__ disjoint. There are _Person_ entities that are both a _Student_ and a _Faculty._
    - You __MUST:__
        - Generate the UNI using first name and last name. This requires a function and triggers.
        - Enforce immutability for ```uni``` and ```created.``` This requires triggers.
        - Provide a procedure ```create_person().``` This procedures's parameters are the fields necessary to create a _Student_ and _Faculty._ The procedure creates the _Student_ entry, _Faculty_ entry or both depending on the inputs.
        - A _view_ that supports ```SELECT``` on _Person._
        - Create a new database user "default_user" with password "dbuserdbuser."
        - Demonstrate the "default_user"
            - Cannot access the tables.
            - Can call ```create_person()```
            - Can query the _Person_ view.
            
        
- Use the schema "uni_midterm".


- We will test the answer you provide in the code cells below.

## Answer

### Create Table/View Statements

In [532]:
_default_connect_info = {
        'host': 'localhost',
        'user': 'dbuser',
        'password': 'dbuserdbuser',
        'db': 'rs3878_midterm',
        'port': 3306
    }

In [507]:
%%sql
use rs3878_midterm;

create table `major`(
  `major_code` int(11) not null auto_increment,
  `major_name` varchar(64) not null,
  primary key (`major_code`),
  unique key `major_name_UNIQUE` (`major_name`)
) ENGINE=InnoDB auto_increment = 6 CHARSET=latin1;

CREATE TABLE `student2` (
  `uni` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `created` datetime not null default current_timestamp,
  `enrollment_year` year(4) NOT NULL,
  `major_code` int(11) NOT NULL,
  PRIMARY KEY (`uni`),
  key `s_to_m_idx` (`major_code`),
  constraint `s_to_m` foreign key (`major_code`) references `major` (`major_code`) 
  on delete no action on update no action
) ENGINE=InnoDB DEFAULT CHARSET=utf8MB3;

create table `faculty_title`(
  `faculty_code` int(11) not null auto_increment,
  `faculty_title` varchar(64) not null,
  primary key (`faculty_code`),
  unique key `title_UNIQUE` (`faculty_title`)
) ENGINE=InnoDB auto_increment = 8 CHARSET=latin1;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:170: Warning: (1287, "'utf8mb3' is deprecated and will be removed in a future release. Please use utf8mb4 instead")
  result = self._query(query)

[]

In [587]:
%%sql
create table `department`(
  `dept_code` varchar(4) not null,
  `dept_name` varchar(64) not null,
  primary key (`dept_code`),
  unique key `name_UNIQUE` (`dept_name`)
) ENGINE=InnoDB DEFAULT CHARSET=latin1;


CREATE TABLE `faculty2` (
  `uni` varchar(12) NOT NULL,
  `last_name` varchar(64) NOT NULL,
  `first_name` varchar(64) NOT NULL,
  `created` datetime not null default current_timestamp,
  `title_code` int(11) NOT NULL,
  `dept_code` varchar(4) not null,
  PRIMARY KEY (`uni`),
  key `f_to_dept_idx` (`dept_code`),
  key `f_to_title_idx` (`title_code`),
  constraint `f_to_dept` foreign key (`dept_code`) references `department`(`dept_code`)
  on delete no action on update no action,
  constraint `f_to_title` foreign key (`title_code`) references `faculty_title`(`faculty_code`)
  on delete no action on update no action   
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.
0 rows affected.

[]

In [508]:
%%sql
SET GLOBAL log_bin_trust_function_creators = 1;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

online resources:
https://stackoverflow.com/questions/26015160/deterministic-no-sql-or-reads-sql-data-in-its-declaration-and-binary-logging-i

In [510]:
%sql use rs3878_midterm;

 * mysql+pymysql://dbuser:***@localhost/lahman2017raw
0 rows affected.

[]

In [533]:
q ="""
create definer=`root`@`localhost` 
function `generate_uni`(first_name varchar(32), last_name varchar(32)) returns varchar(12) charset utf8
begin
    declare f_prefix varchar(2);
    declare l_prefix varchar(2);
    declare prefix_count int;
    declare full_prefix varchar(5);
    declare result varchar(12);

    set f_prefix = lower(substr(first_name, 1, 2));
    set l_prefix = lower(substr(last_name, 1, 2));

    set full_prefix = concat(f_prefix, l_prefix, '%');

    set prefix_count = (select count(*) as count from rs3878_midterm.person2 where uni like(full_prefix));

    set result = concat(f_prefix, l_prefix, prefix_count+1);

    return result;
end
"""
run_q(cnx=None, q=q, args=None, fetch=True)

/anaconda3/lib/python3.6/site-packages/pymysql/cursors.py:329: Warning: (3719, "'utf8' is currently an alias for the character set UTF8MB3, but will be an alias for UTF8MB4 in a future release. Please consider using UTF8MB4 in order to be unambiguous.")
  self._do_get_result()

()

In [534]:
q="""
create definer=`root`@`localhost` 
function `compute_role`(s char(1), f char(1)) returns char(1) charset latin1
begin
    declare result char(1);
    set result = null;
    if s is not null and f is not null then
        set result = 'B';
    else
        if f is not null and f = 'F' then
            set result = 'F';
        else 
            if s is not null and s = 'S' then
                set result = 'S';
            else
                set result = null;
            end if;
        end if;
    end if;
return result;
end
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

In [535]:
q="""
CREATE
    ALGORITHM = UNDEFINED
    DEFINER = `root`@`localhost`
    SQL SECURITY DEFINER
VIEW `person2` AS
    SELECT
        `a`.`uni` as `uni`,
        `a`.`first_name` as `first_name`,
        `a`.`last_name` as `last_name`,
        compute_role(max(`a`.`student`), max(`a`.`faculty`)) as `role`,
        group_concat(`a`.`role`
                    separator ',') as `all_roles`,
        ifnull(group_concat(`a`.`major_code`
                separator ','),
              'NA') as `major_code`,
        ifnull(group_concat(`a`.`enrollment_year`
                separator ','),
              'NA') as `enrollment_year`,
        ifnull(group_concat(`a`.`title_code`
                separator ','),
              'NA') as `title_code`,
        ifnull(group_concat(`a`.`dept_code`
                separator ','),
              'NA') as `dept_code`,
        max(`a`.`created`) as `created`
    from 
        (select 
            `rs3878_midterm`.`student2`.`uni` as `uni`,
            `rs3878_midterm`.`student2`.`first_name` as `first_name`,
            `rs3878_midterm`.`student2`.`last_name` as `last_name`,
             'S' as `student`,
             'S' as `role`,
             null as `faculty`,
            `rs3878_midterm`.`student2`.`major_code` as `major_code`,
            `rs3878_midterm`.`student2`.`enrollment_year` as `enrollment_year`,
             null as `title_code`,
             null as `dept_code`,
            `rs3878_midterm`.`student2`.`created` as `created`
        from
            `rs3878_midterm`.`student2` union 
         select
            `rs3878_midterm`.`faculty2`.`uni` as `uni`,
            `rs3878_midterm`.`faculty2`.`first_name` as `first_name`,       
            `rs3878_midterm`.`faculty2`.`last_name` as `last_name`, 
            null as `student`,
            'F' as `student`,
            'F' as `role`,
            null as `major_code`,
            null as `enrollment_year`,
            `rs3878_midterm`.`faculty2`.`title_code` as `title_code`,       
            `rs3878_midterm`.`faculty2`.`dept_code` as `dept_code`,       
            `rs3878_midterm`.`faculty2`.`created` as `created`
         from 
             `rs3878_midterm`.`faculty2`) as `a`
        group by `a`.`uni`, `a`.`first_name`, `a`.`last_name`
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

### Create Trigger, Function and Procedure Statements

In [561]:
q="""
create definer=`root`@`localhost` function `valid_name`(n varchar(128)) returns tinyint(1)
begin
    declare t1,t2 boolean;
    declare result boolean;
    
    set t1 = (select n REGEXP'[0-9,!,@,*,#,$,%,^,&,(,),+,=,{,},<,>,?,]');
    set t2 = (select n REGEXP '[]]');
    
    if t1 or t2 then 
        set result =false;
    else
        set result = true;
    end if;
return result;
end
""" 
run_q(cnx=None, q=q, args=None, fetch=True)

()

In [513]:
q="""
create definer=`root`@`localhost` 
TRIGGER `rs3878_midterm`.`student2_BEFORE_INSERT` BEFORE INSERT ON `student2` FOR EACH ROW
BEGIN
    declare u varchar(32);
    set u = (select user());
    if not (valid_name(new.first_name) and valid_name(new.last_name)) then
        signal sqlstate '45003'
            set message_text="Not sure that name has valid characters.";
    end if;
    
    if not (new.enrollment_year between year('1980-00-00') and year('2030-00-00')) then
        if u != 'root@localhost' then
            signal sqlstate '45006' set message_text='You are setting a weird date and are not root. Try again.';
        end if;
    end if;
END
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

In [514]:
q="""
create definer=`root`@`localhost` 
TRIGGER `rs3878_midterm`.`faculty2_BEFORE_INSERT` BEFORE INSERT ON `faculty2` FOR EACH ROW
BEGIN
    declare u varchar(32);
    set u = (select user());
    if not (valid_name(new.first_name) and valid_name(new.last_name)) then
        signal sqlstate '45003'
            set message_text="Not sure that name has valid characters.";
    end if;
END
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

In [515]:
q="""
create definer=`root`@`localhost` 
TRIGGER `rs3878_midterm`.`student2_BEFORE_UPDATE` BEFORE UPDATE ON `student2` FOR EACH ROW
BEGIN
    declare u varchar(32);
    set u = (select user()); 
    if u != 'root@localhost' then
        if new.uni != old.uni or new.created != old.created then
            signal sqlstate '45002'
                set message_text="UNI is immutable and cant change created date";
        end if;
    end if;
    
    if not (valid_name(new.first_name) and valid_name(new.last_name)) then
        signal sqlstate '45003'
            set message_text="Not sure that name has valid characters.";
    end if;
    
    if not (new.enrollment_year between year('1980-00-00') and year('2030-00-00')) then
        if u != 'root@localhost' then
            signal sqlstate '45006' set message_text='You are setting a weird date and are not root. Try again.';
        end if;
    end if;
END
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

In [516]:
q="""
create definer=`root`@`localhost` 
TRIGGER `rs3878_midterm`.`faculty2_BEFORE_UPDATE` BEFORE UPDATE ON `faculty2` FOR EACH ROW
BEGIN
    declare u varchar(32);
    set u = (select user()); 
    if u != 'root@localhost' then
        if new.uni != old.uni or new.created != old.created then
            signal sqlstate '45002'
                set message_text="UNI is immutable and cant change created date";
        end if;
    end if;
    
    if not (valid_name(new.first_name) and valid_name(new.last_name)) then
        signal sqlstate '45003'
            set message_text="Not sure that name has valid characters.";
    end if;
END
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

In [537]:
q="""
create definer=`root`@`localhost` procedure `create_person`(
    out uni varchar(12), in first_name varchar(64), in last_name varchar(64),
        in role char(1), in major_code int, in enrollment_year year, in title_code int, in dept_code char(4))
begin
    set uni = generate_uni(first_name, last_name);
    if role = 'S' then
        if title_code is null and dept_code is null then
            insert into student2 (uni, first_name, last_name, major_code, enrollment_year)
            values (uni, first_name, last_name, major_code, enrollment_year);
        else
            signal sqlstate '45001' set message_text="title code and dept code should be null for students";
        end if;
    end if;
    
    if role = 'F' then
        if major_code is null and enrollment_year is null then
            insert into faculty2 (uni, first_name, last_name, title_code, dept_code)
            values (uni, first_name, last_name, title_code, dept_code);
        else
            signal sqlstate '45001' set message_text="major code and enrollment_year should be null for faculty";
        end if;
    end if;
    
    if role ='B' then
        insert into faculty2 (uni, first_name, last_name, title_code, dept_code)
        values (uni, first_name, last_name, title_code, dept_code);
        insert into student2 (uni, first_name, last_name, major_code, enrollment_year)
        values (uni, first_name, last_name, major_code, enrollment_year);
    end if;
    select uni;
end
"""
run_q(cnx=None, q=q, args=None, fetch=True)

()

### Tests

#### Create 3 Students, 3 Faculty Members and Two Persons that are Both.

In [572]:
%%sql
insert into major (major_name)
value ('computer_science');
insert into major (major_name)
value ('applied_mathematics');
insert into major (major_name)
value ('management_science');
insert into major (major_name)
value ('economics');
insert into major (major_name)
value ('statistics');

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [573]:
%%sql
select * from major;

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
5 rows affected.

[(10, 'applied_mathematics'),
 (9, 'computer_science'),
 (12, 'economics'),
 (11, 'management_science'),
 (13, 'statistics')]

In [574]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Junjie",
    "Lin",
    "S",
    9,
    2020,
    null,
    null
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('juli1',)]

In [575]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Jay",
    "Zhou",
    "S",
    12,
    2019,
    null,
    null
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('jazh1',)]

In [576]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Sulong",
    "Wang",
    "S",
    10,
    2019,
    null,
    null
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('suwa1',)]

In [577]:
%%sql
insert into faculty_title (`faculty_title`)
value ('professor');
insert into faculty_title (`faculty_title`)
value ('assistant_professor');
insert into faculty_title (`faculty_title`)
value ('lecturer');

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [579]:
%sql select * from faculty_title;

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
3 rows affected.

[(9, 'assistant_professor'), (10, 'lecturer'), (8, 'professor')]

In [588]:
%%sql
insert into department (`dept_code`,`dept_name`)
value ('Econ','Economics');
insert into department (`dept_code`,`dept_name`)
value ('Math','Mathematics');
insert into department (`dept_code`,`dept_name`)
value ('Stat','Statistics');
insert into department (`dept_code`,`dept_name`)
value ('Psyc','Psychology');

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [589]:
%sql select * from department

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
4 rows affected.

[('Econ', 'Economics'),
 ('Math', 'Mathematics'),
 ('Psyc', 'Psychology'),
 ('Stat', 'Statistics')]

In [590]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Eliza",
    "Wu",
    "F",
    null,
    null,
    8,
    "Stat"
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('elwu1',)]

In [591]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Ziyu",
    "Wang",
    "F",
    null,
    null,
    8,
    "Math"
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('ziwa1',)]

In [592]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Victor",
    "Huang",
    "F",
    null,
    null,
    10,
    "Psyc"
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('vihu1',)]

In [593]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Ruxin",
    "Shen",
    "B",
    11,
    2019,
    8,
    "Econ"
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('rush1',)]

In [594]:
%%sql
call 
    `rs3878_midterm`.`create_person`(
    @uni,
    "Nan",
    "Yuan",
    "B",
    12,
    2021,
    10,
    "Psyc"
    );

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
1 rows affected.

[('nayu1',)]

#### User Rights

- Execute the following SQL statement.

In [603]:
%sql SHOW GRANTS FOR 'default_user'@'%';

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
3 rows affected.

[('GRANT USAGE ON *.* TO `default_user`@`%`',),
 ('GRANT SELECT ON `rs3878_midterm`.`person2` TO `default_user`@`%`',),
 ('GRANT EXECUTE ON PROCEDURE `rs3878_midterm`.`create_person` TO `default_user`@`%`',)]

In [604]:
%sql revoke all privileges, grant option from 'default_user'@'%';

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.

[]

In [605]:
%reload_ext sql
%sql mysql+pymysql://dbuser:dbuserdbuser@localhost/rs3878_midterm

'Connected: dbuser@rs3878_midterm'

In [606]:
%sql grant execute on procedure create_person to 'default_user'@'%';

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.

[]

In [607]:
%sql grant select on `rs3878_midterm`.`person2` to 'default_user'@'%';

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
0 rows affected.

[]

In [608]:
%sql SHOW GRANTS FOR 'default_user'@'%';

   mysql+pymysql://dbuser:***@localhost/lahman2017raw
 * mysql+pymysql://dbuser:***@localhost/rs3878_midterm
3 rows affected.

[('GRANT USAGE ON *.* TO `default_user`@`%`',),
 ('GRANT SELECT ON `rs3878_midterm`.`person2` TO `default_user`@`%`',),
 ('GRANT EXECUTE ON PROCEDURE `rs3878_midterm`.`create_person` TO `default_user`@`%`',)]

#### Demonstrate Queries

Write queries that return:
- All students
- All faculty
- All persons that are both.

In [595]:
cnx = get_connection('docs', host = 'localhost', port = 3306, db = 'rs3878_midterm', 
                     user = 'default_user', password = 'dbuserdbuser')

In [596]:
q = "show tables"
result = run_q(q=q, cnx=cnx, fetch=True)
print(result)

[{'Tables_in_rs3878_midterm': 'person2'}]

In [597]:
q = "show databases"
result = run_q(q=q, cnx=cnx, fetch=True)
print(result)

[{'Database': 'information_schema'}, {'Database': 'rs3878_midterm'}]

In [598]:
q = "select * from information_schema.key_column_usage"
result = run_q(q=q, cnx=cnx, fetch=True)
print(result)

()

In [600]:
try:
    q = "select * from rs3878_midterm.person2"
    result = run_q(q=q, cnx=cnx, fetch=True)
    print(safe_json_dump(result))
except Exception as e:
    print("Got exception: ", e)

[
  {
    "uni": "elwu1",
    "first_name": "Eliza",
    "last_name": "Wu",
    "role": "F",
    "all_roles": "F",
    "major_code": "NA",
    "enrollment_year": "NA",
    "title_code": "8",
    "dept_code": "Stat",
    "created": "2019-03-15 11:53:38"
  },
  {
    "uni": "jazh1",
    "first_name": "Jay",
    "last_name": "Zhou",
    "role": "S",
    "all_roles": "S",
    "major_code": "12",
    "enrollment_year": "2019",
    "title_code": "NA",
    "dept_code": "NA",
    "created": "2019-03-15 11:43:16"
  },
  {
    "uni": "juli1",
    "first_name": "Junjie",
    "last_name": "Lin",
    "role": "S",
    "all_roles": "S",
    "major_code": "9",
    "enrollment_year": "2020",
    "title_code": "NA",
    "dept_code": "NA",
    "created": "2019-03-15 11:42:44"
  },
  {
    "uni": "nayu1",
    "first_name": "Nan",
    "last_name": "Yuan",
    "role": "B",
    "all_roles": "S,F",
    "major_code": "12",
    "enrollment_year": "2021",
    "title_code": "10",
    "dept_code": "Psyc",
    "created": "2019-03-15 11:56:41"
  },
  {
    "uni": "rush1",
    "first_name": "Ruxin",
    "last_name": "Shen",
    "role": "B",
    "all_roles": "S,F",
    "major_code": "11",
    "enrollment_year": "2019",
    "title_code": "8",
    "dept_code": "Econ",
    "created": "2019-03-15 11:55:46"
  },
  {
    "uni": "suwa1",
    "first_name": "Sulong",
    "last_name": "Wang",
    "role": "S",
    "all_roles": "S",
    "major_code": "10",
    "enrollment_year": "2019",
    "title_code": "NA",
    "dept_code": "NA",
    "created": "2019-03-15 11:43:45"
  },
  {
    "uni": "vihu1",
    "first_name": "Victor",
    "last_name": "Huang",
    "role": "F",
    "all_roles": "F",
    "major_code": "NA",
    "enrollment_year": "NA",
    "title_code": "10",
    "dept_code": "Psyc",
    "created": "2019-03-15 11:54:36"
  },
  {
    "uni": "ziwa1",
    "first_name": "Ziyu",
    "last_name": "Wang",
    "role": "F",
    "all_roles": "F",
    "major_code": "NA",
    "enrollment_year": "NA",
    "title_code": "8",
    "dept_code": "Math",
    "created": "2019-03-15 11:54:28"
  }
]

In [601]:
try:
    q = "select * from rs3878_midterm.student2"
    result = run_q(q=q, cnx=cnx, fetch=True)
    print(safe_json_dump(result))
except Exception as e:
    print("Got exception: ", e)

Original exception =  (1142, "SELECT command denied to user 'default_user'@'localhost' for table 'student2'")
Got exception:  (1142, "SELECT command denied to user 'default_user'@'localhost' for table 'student2'")

In [602]:
try:
    q = "select * from rs3878_midterm.faculty2"
    result = run_q(q=q, cnx=cnx, fetch=True)
    print(safe_json_dump(result))
except Exception as e:
    print("Got exception: ", e)

Original exception =  (1142, "SELECT command denied to user 'default_user'@'localhost' for table 'faculty2'")
Got exception:  (1142, "SELECT command denied to user 'default_user'@'localhost' for table 'faculty2'")

![caption](student-faculty er diagram.png)